{
  "aboutTitle": "About",
  "aboutContent": "I am currently looking for new professional opportunities and I am open to collaborations for creative and engaging projects. If you are looking for an enthusiastic, rigorous developer ready to take on challenges, I would be honored to join your team and actively contribute to your projects.",
  "developerTitle": "Front-End Developer",
  "welcomeMessage": "I am a passionate web Front-End developer...",
  "cvButton": "My CV",
  "contactButton": "Contact Me",
  "name": "Fabien JÉGO",
  "title": "Front-End Developer",
  "description": "I am a passionate web Front-End developer with a strong interest in technology and development. Graduated from an intensive 9-month course at OpenClassrooms as a web integrator, I have acquired solid skills and a knowledge level equivalent to a Bac+2, allowing me to successfully carry out ambitious and meticulous projects.",
  "compétences": "Skills",
  "projets": "Projects",
  "accueil": "Home",
  "about": "About",
  "formation": "Training",
  "nom": "Name",
  "search": "Looking for an apprenticeship as a web developer.",
  "naissance": "Birth",
  "ville": "City",
  "Téléphone": "Phone",
  "Entreprise": "Company",
  "sujet": "Subject",
  "errorMessage": "Please fill in all required fields correctly.",
  "errorMessageName": "The name is required.",
  "errorMessageEmail": "E-mail is required.",
  "errorMessageCompany": "Company name required.",
  "errorMessageSubject": "The subject is required.",
  "errorMessageMessage": "The message is required.",
  "envoyer": "Send",
  "setMessage": "Your message has been sent!",
  "setMessage2": "An error has occurred while sending your message.",
  "textDiploma": "OpenClassrooms is an online training platform specializing in digital careers. Recognized for its innovative teaching approach, it offers professional programs leading to state-recognized diplomas. Through a combination of interactive courses, hands-on projects, and personalized mentoring, OpenClassrooms enables learners to acquire practical skills tailored to market needs. It was within this organization that I completed my web development training, allowing me to earn my diploma and master the essential technologies for creating modern and intuitive user interfaces.",
  "buttonDiplome": "Professional Title",
  "portfolio": {
    "OhMyFood": {
      "text": "During my Front-End developer training, I created a 'mobile-first' website for the OhMyFood project. This platform lists high-end restaurant menus and allows customers to pre-order meals to skip queues. I ensured a fully responsive design and integrated refined animations for an enhanced user experience. This project highlighted my expertise in web design and crafting engaging, functional interfaces."
    },
    "Kasa": {
      "text": "As part of my training, I worked on Kasa, a peer-to-peer apartment rental platform in France. My task was to revamp their website using React. Despite having no back-end access, I built the entire application by developing reusable components and implementing routing with React Router. This project demonstrated my ability to handle complex interfaces and problem-solve creatively."
    },
    "724events": {
      "text": "I collaborated with 724events, an event agency, to debug and finalize their showcase website. The project had been started by another developer, and I stepped in to fix issues and complete the test plan, ensuring flawless functionality. This experience refined my debugging skills and ability to bring projects to completion while meeting client expectations."
    },
    "Nina Carducci": {
      "text": "For photographer Nina Carducci, I conducted an SEO audit to identify performance bottlenecks. I optimized images and refined the site’s code to enhance loading speed and structure. My goal was to boost search engine rankings and improve online visibility. This project strengthened my expertise in SEO and website performance optimization."
    },
    "Argent Bank Redux Toolkit": {
      "text": "As part of a simulated project for Argent Bank, I developed a user dashboard in two phases. Initially, I built a responsive web application using React and Redux for state management. Later, I designed the transaction interface and provided API documentation via Swagger. This experience solidified my knowledge of Front-End development, state management, and API specifications."
    },
    "Argent Bank Redux": {
      "text": "In another Argent Bank project, I was responsible for creating the user dashboard. The first phase involved developing a React-based web app with Redux for state handling. In the second phase, I simulated back-end updates by implementing three new routes: POST for data submission, GET for retrieval, and PUT for modifying transactions in MongoDB. Additionally, I introduced a new UI design, refining the user experience. This project deepened my understanding of full-stack development and interface redesign."
    },
    "Booki": {
      "text": "For the Booki project, I handled website integration using HTML and CSS. Collaborating with Sarah, the CTO, and Loïc, the UI designer, I developed fully responsive mockups for desktop, tablet, and mobile. A structured file system was provided, allowing me to focus on design implementation. This project reinforced my skills in Front-End development and responsive web design."
    },
    "Portfolio architecte": {
      "text": "At ArchiWebos, I worked on the portfolio site of interior architect Sophie Bluel. My role involved designing the presentation page, admin login, and a media upload modal. This experience allowed me to refine my skills in Front-End development and interactive UI design while adhering to specific project requirements."
    },
    "Portfolio": {
      "text": "This personal project, developed during my training, showcases my expertise in React. The portfolio is a fully responsive web application, demonstrating my ability to create reusable components and manage application state with hooks. It serves as a reflection of my technical skills in modern web development."
    },
    "NFT": {
      "text": "I developed this showcase website using React to deliver an interactive and modern experience. Featuring Swiper-powered carousels, the site allows smooth navigation through projects and achievements. With full responsiveness, it ensures seamless performance across mobile, tablet, and desktop devices."
    }
  }
}
